# Налаштування
NUM_PHYSICAL_PAGES = 16      # кількість фізичних сторінок (N)
NUM_PROCESSES = 4            # кількість процесів
VIRTUAL_PAGES = 32           # сторінок у віртуальному просторі кожного процесу
WORKING_SET_SIZE = 6         # розмір робочого набору
QUANTUM = 60                 # квант (кількість звернень за один квант)
TOTAL_ACCESSES = 3000        # загальна кількість звернень у симуляції
WS_CHANGE_INTERVAL = 400     # звернень між змінами робочого набору
WRITE_PROBABILITY = 0.30     # частка звернень-записів
LOCALITY_PROBABILITY = 0.90  # частка звернень до робочого набору
